["There is no such thing as gravity, Chuck Norris once said \"you must stay on the ground\" and everyone has been to scared to find out what would happen if they didnt't.","Chuck Norris doesn't nead a gun he just neads a bullet and someone to make him angry","Chuck Norris can impregnate a woman with just a lustful stare.","Chuck Norris doesn't take Viagra. But if he ever did, his penis could knock down a giant redwood tree.","In the time it takes you to read this sentence, Chuck Norris could have killed 25 people. Or completely satisfied 5 women...twice.","Chuck Norris knew where the stolen Death Star plans were.(and he also knew where that shuttle was going.)","Some kids start their own \"clubs\". When Chuck Norris was a kid he started the United States Department of Justice.","Chuck Norris is the only person on Earth to be forgiven for punching the Pope.","Chuck Norris is the only man to ever successfully complete Harvard medical school and Harvard law school.....at the same time.","Chuck Norris once killed a boulder with his bare hands","What you can't argue with is the Chuck Norris motto, which is \"of the Norris, for the Norris, by the Norris.\" Chuck the Norris.","Chuck Norris can change a Diesel engine's spark plugs.","Chuck Norris only started sleeping with Asian women because none of the kids he had could show him how to use chop sticks.","Every February 2nd, Chuck Norris sees his shadow and beats the hell out of it.","Chuck Norris is the last # in pi and that's why nobody has found it, cause you don't find Chuck Norris... he find's... hold on i hear the door bell","Chuck Norris starred in a sequel to the movie \"300\" It's called \"1\"","Chuck Norris banged the tooth fairy.","Once, Chuck Norris walked down a street with a massive erection. There were no survivors.","Chuck Norris' leg kicks hit hard enough to knock the polio vaccine out of your body","Chuck Norris actually smiles two or three times a year, proving that his facial muscles can withstand stresses which would pulp a regular human skull.","what has 4 teeth and 100 legs? the front row of the collingwood cheersquad. why? because Chuck Norris barracks for st. kilda","Chuck Norris once challanged Lance Armstrong to a testicle contest.... Chuck Norris won by 3!","The only thing that can compare to Chuck Norris's dick is a giant spiked dildo","Arnold had to beg Chuck Norris for the role of Terminator.","Chuck Norris can install iTunes without installing Quicktime.","Hot news from the Vatican...white smoke appears. Chuck Norris has been elected Pope! All ye of faith, welcome Pope Charles deNoir-iz Kikyorectumis.","When Chuck Norris tells you to blow it out your ass, you'd better at least attempt it.","Chuck Norris foreskin is the ring on the lord rings.","Chuck Norris doesn't have a send button on his email, it knows its role.","Theres a computer virus named rndhsekck. If you open the virus, it roundhouse kicks you in the face..from Chuck Norris.","Chuck Norris can mxit on a public phone","Once, while driving his Hummer on the way to KFC, Chuck Norris ran a stop sign...up Steven Seagal's ass.","Chuck Norris heard slince talking","Chuck Norris will find you if you don't like this joke.","Chuck Norris has impregnated 73 women. Over the internet. They all died before the end of their first trimester from internal bleeding caused by roundhouse kicks. All babies survived.","Chuck Norris once broke the land speed record on a bicycle that was missing its chain and the back tire.","Chuck Norris can rear-end the car he's driving.","Chuck Norris went to walmart once to buy a new laptop. they told him which was the best price. it was the $9.99 so chuck roundhouse kicked them and said i never asked for the price","Chuck Norris cum is bottled and sold as a strong alcoholic beverage in Greece. The greeks call this drink \"ouzo\".","the only reason Mexican cartel doesn't come to united states is bacause they're afraid of Chuck Norris.","Chuck Norris can cure PMS with his dick.","When Chuck Norris was born, the doctor immedately put a name tag on his wirst, and a Shoalin Monk put a black belt around his waist. The president gave him a cigar.","Did you hear about the crazy lady who tackled the Pope during Christmas Mass at St. Peter's Basilica? Chuck Norris became enraged after hearing this. As a response, Chuck Norris tackled the whole Catholic Church exclaiming, \"If you want it done right, you might as well do it yourself\".","The US did not boycott the 1980 Summer Olympics in Moscow due to political reasons: Chuck Norris killed the entire US team with a single round-house kick during TaeKwonDo practice.","Chuck Norris was born right when Germany started losing World War 2. COINCIDENCE?!!!!!!!!!","Chuck Norris had what Meg Ryan was having.","Chuck Norris does not use spell check. If he happens to misspell a word, Oxford will simply change the actual spelling of it.","There is no Esc key on Chuck Norris' keyboard, because no one escapes Chuck Norris.","All Chuck Norris facts should be told in a respectful whisper, whilst laying one's palms and forehead on the floor.","Chuck Norris can solve a Rubik's Cube with his butt-cheeks.","Chuck Norris once made an ass out of himself on national TV, So the Legend of Chuck Norris exploded from the internet and beat him to death on national TV, showing that not even Chuck Norris is safe from Chuck Norris","If Chuck Norris ate at your restaurant and had only $5 for his $50 meal, you would still owe him change.","When Chuck Norris action figures first came out they had a recall, because they were beating the shit out of little kids.","Chuck Norris was in the Congo and encountered a cannibal. With one piercing look from his steely eyes, Chuck turned him into a vegetarian. Permanently.","the day Chuck Norris jokes get old, the world will end.","On his last camping trip, Chuck Norris used a live porcupine for a pillow.","The only thing that can survive a nuke is twinkes. And Chuck Norris.","Chuck Norris doesn't use straws, he summons the liquid inside him.","When Chuck Norris plays Halo 3, he uses only a pistol. He has never lost. EVER.","Chuck Norris knows what Willis is talking about","Chuck Norris Knighted The Queen","Chuck Norris once played truth or dare there where no survivors. no one dares Chuck Norris and no one asks Chuck Norris to tell the truth.","Chuck Norris saw a dick on TV1000!","The word \"upChuck\" came from the first time Chuck Norris round-house kicked someone in the stomach.","Chuck Norris doesn't commit susicide, susicide commits him","Chuck Norris once participated in the running of the bulls, the bulls were running because Chuck Norris was behind them","Chuck Norris recently appeared on a 15-minute segment of 'Good Morning America', to promote and demonstrate the Total Gym 1000, while holding a bison in a headlock.","Chuck Norris has a .50 BMG Derringer.","There are no steroids in baseball. Just players Chuck Norris has breathed on.","We all know that any mortal punching Chuck Norris' chin is just pressing the big red \"Please Notice and Flatten Me Now\" button hidden under his beard.","Did you know? Rick Ross' \"You are the Boss \" hit was produced by Chuck Norris.","Chuck Norris is what ancient Greeks used to protect their mazes.","Chuck Norris? favourite cut of meat is the roundhouse.","Freddy Krueger can't sleep because he is afraid of Chuck Norris appearing in his dreams.","Chuck Norris is the illegitimate father of Casey Heynes (look it up).","Chuck Norris makes gorilla buiscuts by slamming Kelly Osbourne's face into cookie dough.","Chuck Norris finished the ice bucket challenge by dumping the entire Antarctica continent on his head.","The band still played on while the Titanic was sinking because Chuck Norris stayed on deck to watch them.","CHUCK NORRIS CAN GARGLE PEANUT BUTTER","Someone ask Chuck Norris waht kind of music he listened to. You fool he answered I don't listen to music music listens to me. He then proceeded with a roundhouse kick to the face while the National Anthem listned in the background.","When all else fails.....Chuck Norris doesn't.","Chuck Norris' semen is the main ingredient for napalm.","Chuck Norris delivered him-self.","Michael Jackson denied Chuck Norris' facebook friend request on June 25, 2009...you never deny Chuck Norris.","Chuck Norris does not have any hair on his testicles. Hair doesn't grow on steel.","Chuck Norris once found a piece of hay in a neelestack.","Chuck Norris invented Gravity to prevent people from leaving Earth.","Chuck Norris isn't lusty- he only has bloodlust.","Chuck Norris uses barbwire as dental floss.","If you're ever stupid enough to ask for Chuck Norris' credentials, expect to witness something completely mind-blowing and impossibly awesome just before your brutal death.","Chuck Norris can slice your head off with a baseball bat.","Chuck Norris is suing Myspace for taking the name of what he calls everything around you.","Chuck Norris is the fifth Beatle.","Chuck Norris slapped the black out of Michael Jackson","Chuck Norris trims his pubes with a weed whacker.","Chuck Norris was what Willis was talking about","Chuck Norris has had his left arm amputated - twice.","Chuck Norris once took his pet Sasquatch to a Furry Convention.","Chuck Norris's wife had a baby,he did all the breast feeding!","Chuck Norris ate concrete and shit out a brick","Chuck Norris proved Mythbusters was all a myth.","Chuck Norris never wet his bed as a child. The bed wet itself out of fear.","Chuck Norris can read with his eyes closed and sleep with his eyes open just incase","I once walked into Chuck Norris' house, he had a bear rug.It was still alive,just too afraid to get up.","Chuck Norris struck gold while performing his own prostate exam.","Chuck Norris is the only anagram for 'death' that doesn't contain any of its letters.","One round-house-kick from Chuck Norris can deliver eternal energy to Earth","when Chuck Norris go's on the tea cups at theme parks, he gives the cup whiplash.","Particle physicists have finally developed a new atom smasher. It is called Chuck Norris's fist.","Chuck Norris says that crying is actually allergic reactions to feelings.","Chuck Norris doesn't just bend space-time, he can turn it into a goddamn balloon animal.","Chuck Norris doesn't play god. Playing is for children.","Chuck Norris is suing CNN for using two of his initials in there name...","It is rumored that when Chuck Norris jerks off, it makes other people go blind.","Chuck Norris can stop the the Brian Adams started.","Chuck Norris can break iron with bubbles","Chuck Norris keeps his friends close and his enemies in the morgue.","If Chuck Norris is in your hometown your SCREWED!!!!!!!!!!!!!!!!!!","Chuck Norris has proven we are alone in the universe. We eren't before his first space expidition.","Chuck Norris played battletoads..... after several failed attempts, the game rage quit","Chuck Norris gifted Chuck Berry the gift of the music form commonly known today as rock n roll.","there is no use crying over spilled milk, unless its Chuck Norris' milk because then your gonna die","It goes without saying that you can't hold a candle to Chuck Norris. Mainly because he will fart on it and incinerate you.","After Chuck Norris was born, he drove himself back home.","the fountain of youth is actually Chuck Norris' lavatory","Aliens DO indeed exist. They just know better than to visit a planet that Chuck Norris is on.","Chuck Norris is in everyone of the devil's nightmares","Chuck Norris' homemade Texas chili is so hot that if you ate a bowl of it this evening, you would wish that you had a strawberry snow cone to wipe your ass with tomorrow morning.","A Chuck Norris rape only lasts for 0.4 of a second. The next six hours are demanded.","Chuck Norris once had a horse throat so he went to his personal physician. They both thought it tasted like shrimp scampi.","Mr. T, Arnold Shcwarzzenger, and Chuck Norris are standing in front of God. God says to them,\"I have call you three here because you are the greatest fighters in the world and I have a place for one of you at my right hand. You must prove to me whom of you it shall be.\" Mr. T steps and says \"I pity the fool who doesn't let me sit at His right hand.\" God tells him that he was not good enough and sends Mr. T to hell. Arnold steps up and says \"I was in predator, commando, the terminator. You must choose the governator.\" God tells him not good enough and sends Arnold to hell. God turns to Chuck Norris and say \"Why should you sit beside me?\" Chuck quickly proceeds to roundhouse kick God in the face and say \"Bitch, your in my seat.","Every time someone types 'Chuck Norris', a gas station explodes.","Chuck Norris' passport is his face.","Sand is created by Chuck Norris shouting at rocks.","Chuck Norris wishes you a knuckle sandwich, and a happy throat-punch.","What are you thinking about right now? Chuck Norris says you're thinking about a teddy bear riding a unicycle. If you aren't, your last and shortly upcoming sight will be a GRIZZLY bear riding a MOTORcycle, which is one of the weaker pets of Chuck Norris.","If you ever dream of beating Chuck Norris in a thumb war, the next event in said dream will be a 6734-ton weight falling on you. This is Chuck Norris's roundhouse kick.","Chuck Norris has sex with whales. It is not that he is into sick animal sex, it is just that the whale is the only animal with the vagina that can accommodate Chuck Norris' dick.","Much like a top fuel dragracer, Chuck Norris' penis is equipped with a parachute.","Contrary to popular belief, the groundhog does not fear seeing its shadow. It actually fears seeing Chuck Norris.","we pray for god.god prays for Chuck Norris","Once Chuck Norris played Super Mario and he never loses a life.","Conor McGregor is Chuck Norris' illegitimate son.","Chuck Norris has wings - on his balls ... of steel.","Chuck Norris doesn't use keys, he always kicks the door in.","Chuck Norris can rob a bank with just his vocal cords.","All of Chuck Norris' chinese ex-girlfriends say \"chuck can fuck\" but it didnt work out because \"chuck ig-nore-us\"","Chuck Norris has a million Espurr. When they hug his legs, you better get the bleep out of there, or else you'll die a death worse than a normal Chuck Norris roundhouse kick. Don't believe me? Have you even READ Espurr's Pokedex entries?","Check yourself before you wreck yourself....... Cos roundhouse kicks from Chuck Norris is bad for your health.","Chuck Norris once stopped a runaway locamotive just by glaring at it.","Chuck Norris is the reason for JAL flight 123","The Thousand Islands used to be one big island, but then Chuck Norris's roundhouse kick smashed it into pieces.","Wanna know what happened to Jimmy Hoffa? Chuck Norris happened.","Chuck Norris. Can push a rope","Bill Gates thinks he's Chuck Norris. Chuck Norris actually laughed. Once.","Chuck Norris considers Ben Hur to be a midget.","Chuck Norris recently got a prince albert piercing the size of a dumbbell.","Chuck Norris got a standing ovation by simply walking into a paraplegic convention.","Chuck Norris can fart the entire Walker, Texas Ranger theme song lyrics in Morris Code.","Chuck Norris did not \"lose\" his virginity, he stalked it and then destroyed it with extreme prejudice.","The angel of death once had a near-Chuck Norris experience.","After Michael Jackson's death, investigators turned a blind eye to the huge Chuck Norris-shaped hole in the bedroom wall.","Solid Snake has a beard because Chuck Norris bit his chin an it became a fist","Chuck Norris' penis can bench over 250.","Chuck Norris once screamed \"bloody murder\" in sign language for the hearing impaired.","the only reason Mexican cartel doesn't come to united states is bacause they're afraid of Chuck Norris.","The reason Cobra Commander wears a mask coz his face was disfigured by a roundhouse kick from Chuck Norris by simply mentioning his name.","We would just like to say that Chuck Norris is brilliant compared to almost anything. However if Chuck is compared to the A TEAM he blends into insignificance, Chuck Norris is now shit and worthless compared with these mighty and perpetual warriors of our TV screens. Face Mr T Hannibal Murdoch","'lizards use to be dinosaurs, untill Chuck Norris kicked the height outta them'.","Chuck Norris was originally going to be in Cowboys VS Aliens, but the movie would have been over in about 3 minutes and 7 seconds.","How much wood could a wood chuck chuck if the wood chuck was Chuck Norris? All of it.","No statement can catch the ChuckNorrisException.","Carly Fiorina once crawled through the entire Waco, TX sewer system just to watch Chuck Norris take a shit in a Taco Bell restroom.","When Chuck Norris was a baby, he didn't suck his mother's breast. His mother served him whiskey, straight out of the bottle.","Chuck Norris not only kicks ass and takes names, he kills people and collects their souls.","The only thing scarier than a black hole is a Chuck Norris.","Chuck Norris likes to bring a knife to a gunfight.","A new one, got on it myself after coming home from holidays - a sure \"only Chuck Norris can do THAT!\" Chuck Norris can go through airport security without being humiliated","For the extra added kick to his homemade Texas Chili, Chuck Norris adds a 1/2 cup of Y.pestis infected rat turds as seasoning.","Chuck Norris doesn't commit susicide, susicide commits him","Chuck Norris often goes to funerals with popcorn and soda.","Chuck Norris made Journey stop believing.","Do you know why Chuck Norris doesn't have hair on his balls because hair doesn't grow on steel!","Chuck Norris said 5 \"Bloody Marys\" and 3 \"Candymans\" Simultaneously in an abandoned warehouse mirror. He then saw both of them run away from him.","Slenderman runs from Chuck Norris. Its also the reason why Slenderman has no eyes.....Chuck Norris roundhoused kicked his face.","Hammertime does not stop Chuck Norris","When Chuck Norris sends you a poke on Facebook, it kills you.","Chuck Norris taught Pai Mei from kill bill 2 the Five Finger Heart Exploding Technique.","Chuck Norris is the only gynaecologist in the world who received his credentials based solely on his reputation.","Chuck Norris' nut sack is so flexible that he can literally put one nut on a golf tee and practice his drives.","The term \"Everything is bigger in Texas\" came from Chuck Norris dropping his pants in front of 7,000 out-of-state tourists.","Chuck Norris once farted 5 times while in the check-out line at a Bass Pro Shop. Three Bass Pro Shop employees were immediately hospitalized after accusing Chuck Norris of attempting to steal a duck call and some stink bait.","Chuck Norris has volunteered to remain on earth after the Rapture; he will spend his time fighting the Anti-Christ.","Chuck Norris could order a steak at PETA's cafeteria and get one. But he's far more likely to kick the shit out of all the candy-asses in the place before roundhousing the building into rubble.","Chuck Norris has nicknamed his testicles \"the good, the bad and the ugly\"","When Chuck Norris was born his mother didn't have a enough breast milk so a herd of milking cows were brought in each day. 8 weeks later he was able to dine on Texas BBQ with all the fixins.","DNA: Deoxyribonucleic acid CNA: Chuck Norris, asshole","I played Madden football 18 times with Chuck Norris back in 2007 and we had the Patriots. Chuck opted to simulate the Super Bowl and the Giants beat us 17-14, coincidence? You be the judge....","Helen Keller screamed Chuck Norris's name when she had sex.","JACKSON ... PHAHAH FUCKIN HARDEST GUY IN ROCHDALE HERE REPPIN 2K9 BIG TIME,, PLUS MY SISTER IS FITTTTT !! OFFT SOME NICE PUSSY ON THAT BITCH xx CHUCK NORRIS X","Chuck Norris doesn't believe in ravioli. He stuffs a live turtle with beef and smothers it in pig's blood.","Chuck Norris is your father!","When Chuck Norris showers he doesn't use soap he uses Aromatic Sulfuric Acid.","When Chuck Norris cuts it Footloose, God help anyone within a three-mile radius.","when Chuck Norris deos push ups he deosnt push hiself he pushes the earth down","Love does not hurt. Chuck Norris does.","Some children hang posters of Chuck Norris above their beds to catch nightmares.","Some people can slide down stair banisters. Chuck Norris can slide UP down escalators.","When Bruce Lee did the fighting scene with Chuck Norris, he had to take 500 million gallons of tranquilizer injected in his body just so Bruce Lee could even land a punch on him. He had to use all the tranquilizer in the world to feel those punches. Seriously!","Chuck Norris can run Windows Vista without it crashing...on a 286!","This one time, at band camp, Chuck Norris nailed all the girls and beat the crap out of all the boys.","Chuck Norris favorite cartoon TV show is WWE.","Chuck Norris can ace a test by writing \"Violence\" for every answer, because violence is the answer.","Chuck Norris takes Viagra to LOSE an erection.","Anthrax is reverse-engineered from Chuck Norris' white blood cells and was originally called Chuckthrax.","James Cameron wanted Chuck Norris to play the Terminator. However, upon reflection, he realized that would have turned his movie into a documentary, so he went with Arnold Schwarzenegger.","Haiti once talked about Chuck Norris' momma, we all know what happened to Haiti.","Chuck Norris prefers to make love between a rock and a hard place.","When Chuck Norris goes to the club he doesnt dance, he does \"the Chuck Norris boogey\" aka roundhouse kicking everyone","The world is actually a long action movie franchise and we're all just background characters in Chuck Norris' story.","Chuck Norris doesn't feel your pain... he causes it","For Halloween, instead of using pumpkins, Chuck Norris uses Yakuza heads.","Old MacDonald had a farm, EIEIO. Chuck Norris puched him in the face, EIEIO. That's what made Old MacDonald get dyslexia, OIEIE.","Chuck Norris has more subscribers than Pewdiepie.","Chuck Norris could kick your ass so hard that nine months after you die, your wife would give birth to his foot.","Chuck Norris can stop a red light!","You'll never grasp the true form of Chuck Norris' attack.","Chuck Norris' parents are named after him","Chuck Norris doesn't use web standards as the web will conform to him.","School went to Chuck Norris.","Chuck Norris doesn't use web standards as the web will conform to him."]